# #a = int(input("Число:"))
# print("поспедняя цифра:", a % 10)
# print("первея цифра:", a // 100)
# print("вторая цифра:", a //10 % 10)
# b = a % 10
# c =a // 100
# d = a //10 % 10
# print("произведение цифр:", b * c * d)
# print("сумма цифр:", b + c + d)
# #a = int(input("Число:"))
# if a % 2 == 1:
#     a = a + 1
# else:
#     a = a + 2
# print
# #a = int(input("Число:"))
# r = a / 2
# print ("Длинна" , a * 3.14 )
# print ("Площадь:",  3.14 * r ** 2)
# #a = int(input("Ты прожил секунд:"))
# print ("Ты прожил часов:", a // 3600 )
# print ("Ты прожил минут:", a % 3600 // 60 )
# print ("Ты прожил секунд:", a % 3600 % 60 % 60)
# b = 3600 * 24 - a
# print ("------------------------------------------------------------------------")
# print ("Teбе осталось жить часов:" , b // 3600)
# print ("Teбе осталось жить минут:" , b % 3600 // 60)
# print ("Teбе осталось жить секунд:" , b % 3600 % 60 % 60)
