# Последнее число в твоей жизне:)
# a = int(input("Последнее число в твоей жизне:)"))
# if 5 < a < 10:
#      print("ф")
# if a > 5 and a < 10:
#      print("ф")
# if a > 5 or a < 10:#одно из условий
#      print("ы")

# Списки
# a1 = "Тоха1"
# a2 = "Тоха2"
# a3 = "Тоха3"
# Mega_Toxa = [a1,a2,a3,] # Мега Тоха - список
# # Операции со списком
# Mega_Toxa.append("Тоха4")
# print (Mega_Toxa)
# Mega_Toxa.pop(3)# удалить по индексу
# Mega_Toxa.remove("Тоха1")
# print (Mega_Toxa)

# Двойная индексация
# a = [["Тоха1","Тоха2"],["Самокаты","Компутеры"],["Мама"]]
# print(a[0][1])

# Условия
# a = 7
# if a == 7 or a > 10:
#     print("Ура")

# Находом значение
# a = int(input("Ваше число:"))
# if a < 0:
#     print("Отрицательное")
# if a == 0:
#     print("Ровно нулю")
# if a > 0:
#     print("Положительное")

#Год високостный 😊 / Год не високостный 😥
# a = int(input("Введите число:"))
# if (a % 4 == 0) and (a % 400 == 0 or a % 100 != 0):# and (a % 400 == 0 or a % 100 != 0) - Можно не писать!!!
#     print("Год високостный 😊")
# else:
#     print("Год не високостный 😥")

#Калькулятор
# a = int(input("Введи 1 число:"))
# b = input("Введи операцию:").strip()
# c = int(input("Введи 2 число:"))
# s = ["-", "+", "/", "*", "**", "|"]  # Список символов
# if b in s:
#     if b == "+":
#         print(a + c)
#     elif b == "-":
#         print(a - c)
#     elif b == "/":
#         print(a / c)
#     elif b == "*":
#         print(a * c)
#     elif b == "**":
#         print(a ** c)
#     elif b == "|":
#         print(a | c)

#Числа
# a = int(input("Первое число:"))
# b = int(input("Второе число:"))
# c = int(input("Третье число:"))
# s = [a,b,c]
# print("Максимальное число:",max(s))
# print("Минимальное число:",min(s))

#Счистливый билет#
# a = input("Введи номер билета:")
# if len(a) == 6:
#      f = a[:3]
#      v = a[-3:]
#      s = int(f[0]) + int(f[1]) + int(f[2])
#      c = int(v[-3]) + int(v[-2]) + int(v[-1])
#      if s == c:
#          print ("фортануло! билет удачный!")h
#      else:
#          print("ты лох!")
# else:
#      print("Чё за шляпу ты ввёл?")